Revit 2024 API
Frame Class
 A Frame comprises three vectors at a base point in 3D space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class Frame : IDisposable
Visual Basic
Public Class Frame _
	Implements IDisposable
Visual C++
public ref class Frame : IDisposable
Remarks
 A Frame consists of three vectors at a base point in 3D space. The vectors need not be orthogonal, have unit length, or even be linearly independent, although in practice Frames will usually have linearly independent vectors. Frames may be used to represent a coordinate frame of reference, a moving frame field on a curve, or for other purposes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Frame
See Also
Frame Members
Autodesk.Revit.DB Namespace